# -*- coding: utf-8 -*-
"""
Created on Wed Mar  9 16:43:06 2022

@author: xiejie
"""

import pandas as pd
import numpy as np
import datetime as dt

df =  pd.read_excel(r'd:\专题工作（重要）\产销差工作\存量增量产销差计算明细\2022年3月\总分表清单202203.xlsx',
                    usecols=['营业区域','行政区','网格号','总表户号',
                                            '并列总表编号','楼盘名称','专项工作类型','接收抄表到户日期','总表个数','分表户数',                                            
                                            '总表202203水量','总表202203冲正退补水量','分表202203水量','分表202203冲正退补水量',
                                            ],
                    dtype={'网格号':str,'总表户号':str})
df1 =  pd.read_excel(r'd:\专题工作（重要）\产销差工作\存量增量产销差计算明细\2022年3月\导出供水单元总水量匹配总分表清单202203.xlsx',sheet_name=1,
                    usecols=['户号','计量点用途',                             
                             '202203总表计费水量','202203总表不计费水量','202203分表水量',
                             '3月抄表天数','202201分表日均','202203分表日均','202201分表抄见户数','202203分表抄见户数','抄见户数增减',
                             '202201分表暂收+暂缓发单户数','202203分表暂收+暂缓发单户数','暂收+暂缓发单户数增减'],
                    dtype={'户号':str})
df3 = pd.merge(df,df1,how='outer',left_on='总表户号',right_on='户号',)





# df['营业区域'].unique()

# df1 = df[df['营业区域'].isin(['北区供水分公司白云片'])]

df3 = df3[(df3['接收抄表到户日期']>=dt.datetime.strptime('2021-04-01','%Y-%m-%d'))| (df3['接收抄表到户日期']==pd.NaT)]


df3 = df3.reindex(columns=['营业区域','行政区','网格号','总表户号',
                                            '并列总表编号','楼盘名称','专项工作类型','接收抄表到户日期','总表个数','分表户数', 
                                            '总表202203水量','总表202203冲正退补水量','分表202203水量','分表202203冲正退补水量',
                                            '202203总表计费水量','202203总表不计费水量','202203分表水量',
                                            '3月抄表天数','202201分表日均','202203分表日均','202201分表抄见户数','202203分表抄见户数','抄见户数增减',
                                            '202201分表暂收+暂缓发单户数','202203分表暂收+暂缓发单户数','暂收+暂缓发单户数增减'                                            
                                             ])

df3.to_excel(r'd:\专题工作（重要）\产销差工作\存量增量产销差计算明细\2022年3月\合并结果202203.xlsx')





#--------------------------------

df_nq = pd.read_excel(r'd:\专题工作（重要）\产销差工作\存量增量产销差计算明细\2022年2月\校核南区\南区总分表清单202202.xlsx',
                    usecols=['营业区域','网格号','总表户号',
                                            '并列总表编号','楼盘名称','专项工作类型','接收抄表到户日期','总表个数',
                                            '总表202202水量','分表202202水量','总表202102水量','分表202102水量'],
                    dtype={'网格号':str,'总表户号':str})
df2 = df1[df1['总表户号'].isin(set(df1['总表户号'])-set(df_nq['总表户号']))]


df3 = df_nq[df_nq['总表户号'].isin(set(df_nq['总表户号']) - set(df1['总表户号']))]

df2.to_excel(r'd:\专题工作（重要）\产销差工作\存量增量产销差计算明细\2022年2月\校核南区\没有被选入的总分表总清单202202.xlsx')